; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-25)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 - object)
 (:init 
    (arm-empty)
    (clear b6)
    (on-table b6)
    (clear b7)
    (on b7 b2)
    (on b2 b4)
    (on b4 b5)
    (on b5 b1)
    (on b1 b3)
    (on-table b3))
 (:goal (and 
(on b1 b6)
))
)

; plan
1. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 0 of 1
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
3. (unstack b2 b4)
   deleted: (on b2 b4) (clear b2) (arm-empty)
   added: (holding b2) (clear b4)
   goals met: 0 of 1
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
5. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 0 of 1
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
7. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 0 of 1
8. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
9. (unstack b1 b3)
   deleted: (on b1 b3) (clear b1) (arm-empty)
   added: (holding b1) (clear b3)
   goals met: 0 of 1
10. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 1 of 1
